rust/wrk_rust.log
Running 10s test @ http://127.0.0.1:3000/?q1=1&q2=2&q3=3&q4=4
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     6.95ms    4.00ms 218.17ms   74.73%
    Req/Sec     4.81k   683.04    18.44k    95.76%
  576064 requests in 10.10s, 108.78MB read
Requests/sec:  57036.31
Transfer/sec:     10.77MB