rust/wrk_rust.log
Running 10s test @ http://127.0.0.1:3000/?q1=1&q2=2&q3=3&q4=4
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     6.66ms    4.92ms 214.62ms   86.38%
    Req/Sec     5.00k     1.06k   29.79k    92.43%
  597651 requests in 10.10s, 112.85MB read
Requests/sec:  59170.64
Transfer/sec:     11.17MB